[
  {
    "id": "372d0620-9ac7-415d-a066-dd2b2e03ec19",
    "title": "Russian Woman With Expired Business Visa Found Living In Karnataka's Cave With 2 Daughters",
    "content": "A 40-year-old Russian woman and her two daughters were resucued from a remote and dangerous cave atop the Ramatirtha Hill in Karnataka’s Gokarna. The local police found the three living in an makeshift dwelling in the forest. As per the reports, they have been living in isolation for about two weeks. The police, during routine patrol, found them and rescued them at around 5 pm on July 9.\r\nThe Russian woman, identified as Nina Kutina, was in the cave that is located in a landslide prone zone with her 6-years-old daughter Prema and 4-year-old Ama.\r\n\r\nAs per a report by NDTV, Kutina came Gokarna from Goa to seek spiritual solitude. She told the police that she chose to live in forest as she wanted to engage in meditation and prayer. Further she also added that she was seeking some pause from the urban chaos.\r\n\r\nMeanwhile, the police expressed concern over the unsafe location.\r\n\r\nNotably, Ramatirtha Hill, where the cave is located, experienced a major landslide in July 2024 and is home to dangerous wildlife, including venomous snakes, making it a hazardous area.\r\n\r\nAfter counseling the woman and informing her of the risks, the police successfully rescued the family and escorted them down the hill. At her request, the woman was relocated to an ashram in Bankikodla village of Kumta taluk, run by 80-year-old female monk Swami Yogaratna Saraswati.\r\n\r\nDuring the regular questioning by the police, welfare officers, and the head of the ashram, she eventually told that her documents like visa and passport may have been lost in the forest cave.\r\n\r\nA joint search operation conducted by the Gokarna Police and Forest Department officials led to the recovery of her passport and visa. Upon examination, it was found that Nina had originally entered India on a Business Visa valid until April 17, 2017. An Exit Permit had been issued by the FRRO in Panaji, Goa, on April 19, 2018. Records showed that she had subsequently traveled to Nepal and re-entered India on September 8, 2018, thereby overstaying her permitted duration.",
    "image": "/uploads/fae48a02-c9e5-4bdf-a960-ac4dacb6d4b9.jpg",
    "timestamp": "2025-07-12T11:48:55.686Z"
  },
  {
    "id": "0ec77926-9f88-4e89-a994-443c0b9ac04e",
    "title": "Blog | The Longest Fight: The Unseen Struggles To Save Nimisha Priya In Yemen",
    "content": "The case of Nimisha Priya, an Indian nurse from Kollankod in Kerala's Palakkad district, sentenced to death in Yemen, is not just a legal battle-it is a deeply human story of a mother's tears, a daughter's suffering, and a society's moral conscience. This mission has taken me across countries, courtrooms, and countless sleepless nights since 2019. But the fight to bring her home began even earlier-thanks to one man's determination.\r\nIt was Samuel Jerom Bhaskar, a Gulf-based humanitarian, who first brought Nimisha's case to the outside world. In 2018, he visited General VK Singh, then Union Minister of State for External Affairs, to raise the alarm about her dire situation. That same year, he gave a compelling interview to Malayala Manorama's Rony, helping shine a spotlight on the case in Kerala. His efforts laid the foundation for the public awareness and diplomatic initiatives that followed. \r\n\r\nIn 2019, I came across a small newspaper clipping about the case. That brief report stirred something deep inside me. I could not remain indifferent. I began what would become a relentless and emotionally demanding journey to save a woman's life in one of the world's most conflict-ridden nations. \r\n\r\nBy 2020, I had managed to locate Nimisha's family-her mother Prema Kumari, her husband Tomi, and their daughter Mishel. Nimisha comes from a modest background. Her mother, a widow, worked as a housemaid in Kizhakkambalam, Ernakulam. In an act of enormous sacrifice, she sold her only property in Palakkad to fund her daughter's legal expenses in Yemen. Each time I visited Kerala, I made it a point to see her. Her quiet resilience gave me the strength to continue. Through independent efforts, I traced people connected to the case and eventually gained contact with Nimisha, who was being held at Sana'a Central Prison. In 2020, I became the first Indian to establish direct communication with her inside the prison despite strict restrictions. In our early conversations, she mentioned Samuel, who had already been helping her since 2017.\r\n\r\nAfter several attempts, I connected with Samuel on May 28, 2020, via Google Duo. That conversation was a turning point. We made a solemn commitment: we would fight together until Nimisha came home. That bond of purpose became the foundation of our mission.\r\n\r\nIn September 2020, the Yemeni Appeal Court reaffirmed Nimisha's death sentence. Realizing the urgency, Samuel, Badr, Nafie, and I approached the Yemeni High Court through Indian Embassy-appointed lawyer Mr. Abdullah Ezzi Amir.\r\n\r\nEarlier, I had reached out to Adv. Abdul Karim, who had been appointed by Nimisha herself and served as her lawyer from 2017 to 2020. As a lawyer, I contacted him in 2020 to understand the legal status of the case in detail. However, after reviewing the situation, it became clear that the case's gravity demanded stronger and more resourceful representation. We then appealed to the Indian government, and the Ministry of External Affairs (MEA) responded promptly, facilitating the appointment of a more experienced lawyer through the Indian Embassy.\r\nTo coordinate our growing efforts, we officially formed the Save Nimisha Priya Action Council in October 2020. It became the legal, humanitarian, and diplomatic engine behind the case. We launched a public crowdfunding campaign, with special thanks to Shajan Scaria (Marunadan Malayali) for playing a vital role in mobilising media and public support.\r\n\r\nIn 2023, we approached the Delhi High Court, seeking permission for Nimisha's mother to visit her daughter in Yemen. The court granted the plea, and she travelled with Samuel. Since April 2024, Nimisha's mother has remained in Yemen, regularly visiting her daughter and playing a vital role in the tribal negotiation efforts.\r\n\r\nA turning point came with the support of Ambassador Dr. Chandra Mauli (2022-2024), who guided us through the complexities of the Yemeni tribal justice system. Negotiations for a pardon involve two ceremonial stages: pre-negotiation and formal negotiation, led by tribal leaders and sheikhs. Our local lawyer Abdullah Ezzi Amir and Power of Attorney holder Samuel took charge on the ground.\r\nIn September 2024, with MEA's assistance, we transferred the first installment of USD 20,000 via the Indian Embassy to the lawyer to initiate pre-negotiation rituals.\r\n\r\nHowever, two members within the council objected to releasing the second installment, falsely alleging that the funds might be used to \"buy weapons\" as part of tribal customs. These claims caused unnecessary delays and confusion. They also demanded an audit of the first payment, further stalling the process.\r\n\r\nDespite these challenges, the majority stood united. The second installment was finally approved and sent in January 2025. Following this, Samuel Jerom Bhaskar offered USD 1 million to the victim's family as Diyah (blood money)-the final legal provision under Yemeni law that can secure a pardon. Unfortunately, the victim's family has not accepted the offer yet, and a formal pardon remains pending.\r\n\r\nIn the meantime, Nimisha's mother continues to visit her daughter in prison, holding together the legal and emotional threads of the negotiation. Her strength, as a mother standing alone in a foreign land, is the soul of this mission.\r\n\r\nLet me be clear: I am not justifying the crime. I am not attacking the deceased Talal, nor am I blaming his family. But Nimisha, from a small village in Palakkad, dared to dream big. She and her husband Tomi borrowed heavily to open a nursing home in Yemen. That dream collapsed. They lost everything. I can feel Tomi's pain. I see Mishel's pain. I walk beside Prema Kumari's pain-because I have been part of their journey since 2019.\r\n\r\nThis mission would not have advanced without the support of:\r\n\r\n- MoS V. Muraleedharan\r\n\r\n- MEA Joint Secretary, Gulf Division\r\n\r\n- Ambassador Dr. Chandra Mauli\r\n\r\n- MPs: Dr. Shashi Tharoor, John Brittas, Dean Kuriakose, Remya Haridas, Radhakrishnan\r\n\r\n- External Affairs Minister Dr. S. Jaishankar and Gen. V. K. Singh\r\n\r\n- Embassy officials Nafa and Badr\r\n\r\n- Council Patrons: Babu MLA (Nenmara), Moosa Master, Babu John\r\n\r\n- Mr. Jayan Idapal, Convenor of the Action Council\r\n\r\n- Key members of the Save Nimisha Priya Action Council: O V Musthafa, Azad Tirur, K V Shamsuddin,\r\n\r\nSajeev Kumar, and Rafeeque Ravuthar\r\n\r\n- And good Samaritans from around the globe who stood with us morally, financially, emotionally, and physically.\r\n\r\nIn this journey, I can't forget the unwavering support of Babu John and Moosa Master-who stood by me at every step, with strength, compassion, and complete trust. We fondly remember late Shri Oommen Chandy, whose early support laid a moral foundation for this fight. His legacy is now carried forward by Chandy Oommen MLA and Dr. Maria Oommen. This is not just a legal matter. It is a humanitarian, moral, and personal mission. And we will not stop until Nimisha Priya walks free again on Indian soil.\r\n\r\n\"How Can I Be Silent?\"\r\n\r\nI am a mother. I am a daughter. I am a woman.\r\n\r\nAnd when I hear a mother cry, \"Give me back my daughter,\"\r\n\r\nWhen I hear a daughter beg, \"Please bring back my mother,\"\r\n\r\nAnd when a woman is on her knees, pleading for her life-\r\n\r\nI cannot remain silent.\r\n\r\nTheir cries echo inside me.\r\n\r\nTheir pain is mine.\r\n\r\nTheir fear, their desperation-it shakes my soul.\r\n\r\nBecause I know what it means to love, to fear, to lose.\r\n\r\nAnd I also know what it means to fight-especially when silence would be easier.\r\n\r\nI carry their voices within me.\r\n\r\nAnd I will not look away.\r\n\r\nNot as a lawyer.\r\n\r\nNot as an activist.\r\n\r\nNot as a fellow human being.\r\n\r\nJustice is not just about laws.\r\n\r\nIt is about listening to the cries the world chooses to ignore.\r\n\r\nI may not have all the answers, but I will never stop standing with them.\r\n\r\nBecause silence in the face of such pain is complicity.\r\n\r\nAnd I will never be complicit in their suffering\r\n\r\n(Deepa Joseph is Vice Chairperson of Save Nimisha Priya International Action Council)",
    "image": "/uploads/1cf74b83-51f1-4509-a566-c141643d46e9.jpg",
    "timestamp": "2025-07-12T11:50:32.385Z"
  },
  {
    "id": "b3b20761-e217-4b72-9545-96c5828e0e37",
    "title": "Kapil Sharma breaks silence after attack on Kap’s Café in Canada; writes ‘We are processing the shock but we are not giving up’",
    "content": "Kapil Sharma’s recently launched venture, Kap’s Café, in Surrey, British Columbia, was shaken after shots were fired at the building housing the café on July 9. The news has left fans shocked and concerned, especially given the comedian’s emotional response on social media.\r\n\r\nIn an official statement shared by Kapil’s team on Instagram, he wrote, “A message from the heart. We opened Kap’s Café with hope of bringing warmth, community and joy through delicious coffee and friendly conversation. To have violence intersect with that dream is heartbreaking. We are processing the shock but we are not giving up.”\r\nThe heartfelt post further added, “Thank you for your support. Your kind words, prayers and memories shared via DM mean more than you know. This café exists because of your belief in what we’re building together. Let’s stand firm against violence and ensure Kap’s Café remains a place of warmth and community. From all of us at Kap’s Café—thank you and see you soon under better skies. With hope and gratitude.”\r\n\r\nAccording to Canadian media reports, an unidentified man fired at least nine rounds at the building from a moving vehicle before fleeing the scene. Disturbing footage from the incident shows the shooter firing repeatedly before making a quick getaway. Fortunately, no one was injured in the attack. The local police have launched an investigation, and further details are awaited.\r\nKapil Sharma, who recently stepped into the hospitality business, had launched the café with the support of his wife, Ginni Chatrath. Just days before the incident, Ginni had shared joyful glimpses of the café’s interiors on Instagram. Many from the entertainment industry, including Kiku Sharda, had sent in congratulatory messages.\r\n\r\nThe attack has undoubtedly cast a shadow, but Kapil’s response is one of resilience and hope.\r\n\r\n",
    "image": "/uploads/b7d03abb-4fb7-47de-881a-75c03f68165a.jpg",
    "timestamp": "2025-07-12T11:51:57.153Z"
  },
  {
    "id": "5142ad25-3b3b-41c2-8191-55d823d3f400",
    "title": "Pakistani actor Humaira Asghar Ali died in October 2024, body found after 9 months, no odour due to open balcony: Report",
    "content": "In a shocking discovery, the decomposed body of Pakistani actor Humaira Asghar Ali was found in her Karachi apartment on Tuesday, nearly nine months after her presumed death. Authorities believe she passed away in October 2024, but her remains were only uncovered following a complaint from her landlord over unpaid rent.\r\nAccording to Arab News, the police broke into her apartment and found her body in an advanced state of decomposition. Investigators stated, \"Humaira’s body is likely nine months old. She probably died between paying her last utility bills and when her electricity was disconnected in October 2024, probably due to non-payment of the bill.\"\r\n\r\nOne of the most puzzling aspects of the case is how her death went unnoticed for so long. Police noted there were no strong odours to alert neighbours. The reason? A combination of environmental factors. “There was an open balcony door and the apartment next to hers was vacant,” an officer explained, which helped diffuse any potential smells.\r\n\r\nThe apartment bore signs of long neglect. Utilities had been disconnected, jars in the kitchen were rusted, and food had expired at least six months ago. These clues supported the timeline suggested by investigators.\r\nDeputy Inspector General of Police Syed Asad Raza confirmed, \"As per Call Detail Record (CDR) the last call was made in October 2024,\" which aligned with forensic findings. The post-mortem report had initially indicated that the death occurred at least a month before the body was found.\r\n\r\nHer brother, Naveed Asghar, travelled to Karachi to claim her remains. Speaking to the media, he said, \"We have come here and, after fulfilling all the legal requirements, have received the dead body.\" The family, he admitted, was stunned by the tragic circumstances.\r\n\r\n“Shocked” was the word Naveed repeatedly used to describe the family's reaction. He added, \"That is why my father said that if there is any emergency, then you can bury her there [in Karachi].\" Humaira had become increasingly distant from the family, with minimal contact over the last seven years.",
    "image": "/uploads/31382536-21e1-478f-82d5-2770c097976b.jpg",
    "timestamp": "2025-07-12T11:53:00.153Z"
  },
  {
    "id": "e81b8abf-6f08-40f2-8218-46ca910a384d",
    "title": "Idhar kafi restrictions hai, wanna enjoy life: Radhika's chats with tennis coach",
    "content": "Tennis star Radhika Yadav, who was shot dead by her father in Gurugram, was planning to move abroad as she felt there were too many restrictions, her WhatsApp chats with her coach revealed. Her father admitted to killing her\r\n\r\nIn the chats accessed by India Today, Radhika told her coach, \"Idhar kaafi restrictions hai, wanna enjoy life.\" She expressed a desire to move away from her family as she wanted to enjoy life.\r\nRadhika also discussed moving abroad and Dubai and Australia were among her choices while she dismissed China due to fewer food choices.\r\n\r\nSandeep Kumar, PRO, Gurugram Police told India Today that Radhika's father was arrested in connection with the murder and the murder weapon, a licenced pistol was seized from the spot. During the interrogation, he admitted that he was upset with his daughter running a tennis academy.\r\n\r\n\"He said he was financially well off so his daughter need not run the academy. They had frequent arguments about this,\" he said.\r\n\r\nPolice has ruled out honor killing angle in this murder.",
    "image": "/uploads/be880477-e5cb-43e3-8624-39b27563cfbb.jpg",
    "timestamp": "2025-07-12T11:54:05.303Z"
  },
  {
    "id": "4fd15e31-6f62-45cb-8165-772ba4d936e4",
    "title": "Stay cautious against those who try to divide Hindus and Sikhs: Yogi Adityanath",
    "content": "Uttar Pradesh Chief Minister Yogi Adityanath on Saturday claimed attempts were being made to drive a wedge between the Hindus and Sikhs, and urged the people to be wary of such actions.\r\n\r\nHe also claimed that the now-behind bars, Chhangur Baba of Balrampur, had fixed rates for religious conversions, leading to transactions to the tune of Rs 100 crore.\r\nAdityanath made the remarks at the flagging-off of UP-Delhi Balidan Sandesh Yatra, being held to mark the 350th martyrdom day of Guru Teg Bahadur.\r\n\r\nHe said that some cases of conversion have come to the fore in Pilibhit also, and asked the people to be a \"little cautious\" of religious conversions.\r\n\r\n\"You must have seen what kind of conspiracy is going on. We have recently taken a big action in Balrampur. You must have seen that he had fixed the rates. That is, how to take forward the programme of conversion. He had fixed the rates for converting Hindus, Brahmins, Kshatriyas, Sikhs, other OBC castes, Scheduled Castes and (Scheduled) Tribes. Money was coming in from abroad. Just think, transactions worth more than Rs 100 crore have been received in his 40 accounts so far,\" the chief minister said.\r\n\r\nHe said that he had dispatched a team to the district to conduct 'ghar wapsi' (returning to original faith) of the converted.\r\nThe UP Anti-Terrorism Squad on July 6 arrested Jalaluddin alias Chhangur Baba and Neetu alias Nasreen, both natives of Madhpur in Balrampur district, for allegedly running a massive conversion racket.\r\n\r\nThe Enforcement Directorate on Thursday said it had found inputs that suggested that the man amassed funds worth about Rs 106 crore, mainly from the Middle East, in 40 bank accounts linked to him and his associates, agency sources said.\r\n\r\nAt the event, Adityanath paid his tributes to the Sikh gurus and hailed them for their sacrifice.\r\n\r\n\"Circumstances have changed. Their objective is the same as it was at that time. Yes, they have changed their way of working. And this event is inspiring all of us for the purpose for which the Sikh Gurus had sacrificed their lives,\" he said.\r\n\r\n\"Remember that many people will try to create divisions between Hindus and Sikhs ... There is a conspiracy among us to divide us and weaken us. Who will save us from this? We will have to be cautious,\" the BJP leader said.\r\nAdityanath also mentioned Mughal Emperor Aurangzeb and denounced him for his atrocities.\r\n\r\n\"What a time it must have been when there was a cruel and brutal ruler like Aurangzeb. At that time, news of atrocities came from not just one place but from everywhere,\" he said.\r\n\r\nHe said the ruler started a massive campaign of Islamisation, which was challenged by Guru Teg Bahadur Ji Maharaj.\r\n\r\n\"And what atrocities were not committed on him,\" he said.\r\n",
    "image": "/uploads/0e913bc3-71ec-47cb-b341-12776a4e0810.jpg",
    "timestamp": "2025-07-12T11:55:10.970Z"
  }
]